# Module 2 Exercises - Explore Data

### Exercise 1:
Use the pandas library to read in the file "travel-times.csv" as a dataframe. Set the dataframe's variable name as "travel_df".

*Note*: Download the file from [here](https://notebooks.azure.com/priesterkc/projects/DABmaterial/tree/Lv1%20Data%20Analytics/datasets).

In [87]:
import numpy as np
import pandas as pd
travel_df=pd.read_csv("datasets/datasets_travel_times.csv")#import the file and read as a dataframe csv file

### Exercise 2:

Use the pandas library to read in the file "income_expenses.xlsx" as a dataframe. Set the dataframe's variable name as "expense_df".

*Note*: Download the file from [here](https://notebooks.azure.com/priesterkc/projects/DABmaterial/tree/Lv1%20Data%20Analytics/datasets).

In [88]:
import numpy as np
import pandas as pd
expense_df=pd.read_excel("datasets/datasets_income_expenses.xlsx")#import the file and read as a dataframe excel file

### Exercise 3:
Using the lists in the cell below, write code that will zip up the lists and make them into one list, then turn it into a dataframe. Next, export the dataframe as a csv file. Then try exporting the dataframe as an Excel file.

In [89]:
names = ['Nike','Adidas','New Balance','Puma','Reebok']
grades = [176,59,47,38,99]

In [90]:
shoes=list(zip(names,grades))#zipping the two lists in one list
df_shoe=pd.DataFrame(data=shoes,columns=['names','grades'])#creating a dataframe so that the pandas can read 
df_shoe #prints the new dataframe list as two columns and default index

         names  grades
0         Nike     176
1       Adidas      59
2  New Balance      47
3         Puma      38
4       Reebok      99

In [91]:
df_shoe.to_csv('shoeModels.csv', index= False, header= False)
# exporting the data in to the cureent directory as csv file

In [92]:
df_shoe.to_excel('shoeModels.xlsx',index = False, header=False)
#exporting the data in to the cureent directory as excel file

### Exercise 4:

What columns are in the travel_df dataframe? What columns are in the expense_df dataframe?

In [93]:
travel_df.columns# lists the names of the columns in travel_df data

Index(['Date', 'StartTime', 'DayOfWeek', 'GoingTo', 'Distance', 'MaxSpeed',
       'AvgSpeed', 'AvgMovingSpeed', 'FuelEconomy', 'TotalTime', 'MovingTime',
       'Take407All', 'Comments'],
      dtype='object')

In [94]:
expense_df.columns#lists the names of the columns in expense_df data

Index(['Income Range', 'Category', 'Amount', 'Class_level'], dtype='object')

In [101]:
expense_df.head()

  Income Range                    Category  Amount Class_level
0     $100-200                        Rent   26.43        Poor
1     $100-200                        Food   59.81        Poor
2     $100-200                     Clothes   38.95        Poor
3     $100-200                       Taxes    0.14        Poor
4     $100-200  Other Expenses and Savings   13.77        Poor

In [104]:
expense_df.groupby(['Class_level']).sum()

              Amount
Class_level
Comfortable  1437.00
Fair          769.50
Poor          388.55
Well To-Do   1125.00

### Exercise 5:

Using the expense_df dataframe, sum the expense amount using the group_by function by income range.

In [27]:
expense_df.groupby(expense_df['Income Range']).sum()

               Amount
Income Range
$100-200       139.10
$1000+        1125.00
$200-300       249.45
$300-400       335.68
$400-500       433.82
$500-750       557.00
$750-1000      880.00

### Exercise 6:

Using the travel_df dataframe and pivot_table function, get the average total time by day of the week and direction traveled (Home/GSK).

In [95]:
travel_df.pivot_table('TotalTime', index=['DayOfWeek','GoingTo'])
#avergae total time by day of the week and travelled Home/GSK

                   TotalTime
DayOfWeek GoingTo
Friday    GSK      37.628571
          Home     38.238462
Monday    GSK      44.747368
          Home     41.725000
Thursday  GSK      40.204167
          Home     42.345000
Tuesday   GSK      42.079167
          Home     42.962500
Wednesday GSK      42.087500
          Home     44.300000

### Exercise 7:

Choose either the travel_df or expense_df and do some exploratory analysis.

In [97]:
travel_df.describe()

,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,TotalTime,MovingTime
count,205.000000,205.000000,205.000000,205.000000,205.000000,205.000000
mean,50.981512,127.591707,74.477561,81.975610,41.904390,37.871707
std,1.321205,4.128450,11.409816,10.111544,6.849476,4.835072
min,48.320000,112.200000,38.100000,50.300000,28.200000,27.100000
25%,50.650000,124.900000,68.900000,76.600000,38.400000,35.700000
50%,51.140000,127.400000,73.600000,81.400000,41.300000,37.600000
75%,51.630000,129.800000,79.900000,86.000000,44.400000,39.900000
max,60.320000,140.900000,107.700000,112.100000,82.300000,62.400000

In [98]:
expense_df.describe()

           Amount
count   35.000000
mean   106.287143
std    120.399752
min      0.000000
25%     31.890000
50%     65.070000
75%    152.425000
max    568.130000